zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47Z42082/KW47Z42082_COMMON.h
#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field##_SHIFT)) & (field##_MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field##_MASK)) >> (field##_SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#if defined(KW47B42Z83_cm33_core0_H_) || defined(KW47B42Z96_cm33_core0_H_) || defined(KW47B42Z97_cm33_core0_H_) || defined(KW47B42ZB2_cm33_core0_H_) || defined(KW47B42ZB3_cm33_core0_H_) || defined(KW47B42ZB6_cm33_core0_H_) || defined(KW47B42ZB7_cm33_core0_H_) || defined(KW47Z420B2_H_) || defined(KW47Z420B3_H_) || defined(KW47Z42082_H_) || defined(KW47Z42092_H_)
#define RADIO_IS_GEN_4P7 (1)
#define NXP_RADIO_GEN (470)
#define IS_APP_CORE (1)
#define IS_RADIO_CORE (0)
#ifndef KW47_core0_SERIES
#define KW47_core0_SERIES
#endif

/*! @brief define LTC0 from LTC. */
#define LTC0 LTC


/*
 * Macros below define the chip revision.
 */
#define DEVICE_REVISION_A0     (0x10U)
#define DEVICE_REVISION_A1     (0x10U)
#define DEVICE_REVISION_A2     (0x10U)
#define DEVICE_REVISION_A2_1   (0x13U)
#define DEVICE_REVISION_OTHERS (0xFFU)

#define IS_CHIP_REVISION_A0()   (DEVICE_REVISION_A0 == Chip_GetVersion())
#define IS_CHIP_REVISION_A1()   (DEVICE_REVISION_A1 == Chip_GetVersion())
#define IS_CHIP_REVISION_A2()   (DEVICE_REVISION_A2 == Chip_GetVersion())
#define IS_CHIP_REVISION_A2_1() (DEVICE_REVISION_A2_1 == Chip_GetVersion())

/*!
* @brief Get the chip value.
*
* @return chip version, 0x10: A0, A1 or A2 version chip, 0x13: A2.1 version chip, 0xFF: invalid version.
*/
static inline uint8_t Chip_GetVersion(void)
{
    uint8_t deviceRevision;

    deviceRevision = (uint8_t)(*((uint8_t *)0x14817FCC)) & 0xFFu;

    return deviceRevision;
}

/*
 * CE STCMs base address.
 */
#define CE_STCM5_BASE (0x20020000u)
#define CE_STCM6_BASE (0x20028000u)
#define CE_STCM7_BASE (0x20030000u)

#define PLATFORM_CTCM0_IDX 0U
#define PLATFORM_CTCM1_IDX 1U
#define PLATFORM_STCM0_IDX 2U
#define PLATFORM_STCM1_IDX 3U
#define PLATFORM_STCM2_IDX 4U
#define PLATFORM_STCM3_IDX 5U
#if !(defined(KW47B42Z83_cm33_core0_H_) || defined(KW47Z42082_H_))
/* 136KB phantom does not support STCM4, STCM5, STCM6 and STCM7 */
#define PLATFORM_STCM4_IDX 6U
#define PLATFORM_STCM5_IDX 7U
#define PLATFORM_STCM6_IDX 8U
#define PLATFORM_STCM7_IDX 9U
#endif
#define PLATFORM_STCM8_IDX 10U

#define PLATFORM_CTCM0_START_ADDR (0x04000000U)
#define PLATFORM_CTCM0_END_ADDR   (0x04003FFFU)
#define PLATFORM_CTCM1_START_ADDR (0x04004000U)
#define PLATFORM_CTCM1_END_ADDR   (0x04007FFFU)
#define PLATFORM_STCM0_START_ADDR (0x20000000U)
#define PLATFORM_STCM0_END_ADDR   (0x20003FFFU)
#define PLATFORM_STCM1_START_ADDR (0x20004000U)
#define PLATFORM_STCM1_END_ADDR   (0x20007FFFU)
#define PLATFORM_STCM2_START_ADDR (0x20008000U)
#define PLATFORM_STCM2_END_ADDR   (0x2000FFFFU)
#define PLATFORM_STCM3_START_ADDR (0x20010000U)
#define PLATFORM_STCM3_END_ADDR   (0x20017FFFU)
#if !(defined(KW47B42Z83_cm33_core0_H_) || defined(KW47Z42082_H_))
/* 136KB phantom does not support STCM4, STCM5, STCM6 and STCM7 */
#define PLATFORM_STCM4_START_ADDR (0x20018000U)
#define PLATFORM_STCM4_END_ADDR   (0x2001FFFFU)
#define PLATFORM_STCM5_START_ADDR (0x20020000U)
#define PLATFORM_STCM5_END_ADDR   (0x20027FFFU)
#define PLATFORM_STCM6_START_ADDR (0x20028000U)
#define PLATFORM_STCM6_END_ADDR   (0x2002FFFFU)
#define PLATFORM_STCM7_START_ADDR (0x20030000U)
#define PLATFORM_STCM7_END_ADDR   (0x20037FFFU)
#endif
#define PLATFORM_STCM8_START_ADDR (0x20038000U)
#define PLATFORM_STCM8_END_ADDR   (0x20039FFFU)

#if !(defined(KW47B42Z83_cm33_core0_H_) || defined(KW47Z42082_H_))
#define PLATFORM_BANK_START_ADDR                                                                                    \
    PLATFORM_CTCM0_START_ADDR, PLATFORM_CTCM1_START_ADDR, PLATFORM_STCM0_START_ADDR, PLATFORM_STCM1_START_ADDR,     \
        PLATFORM_STCM2_START_ADDR, PLATFORM_STCM3_START_ADDR, PLATFORM_STCM4_START_ADDR, PLATFORM_STCM5_START_ADDR, \
        PLATFORM_STCM6_START_ADDR, PLATFORM_STCM7_START_ADDR, PLATFORM_STCM8_START_ADDR

#define PLATFORM_BANK_END_ADDR                                                                              \
    PLATFORM_CTCM0_END_ADDR, PLATFORM_CTCM1_END_ADDR, PLATFORM_STCM0_END_ADDR, PLATFORM_STCM1_END_ADDR,     \
        PLATFORM_STCM2_END_ADDR, PLATFORM_STCM3_END_ADDR, PLATFORM_STCM4_END_ADDR, PLATFORM_STCM5_END_ADDR, \
        PLATFORM_STCM6_END_ADDR, PLATFORM_STCM7_END_ADDR, PLATFORM_STCM8_END_ADDR

#else
#define PLATFORM_BANK_START_ADDR                                                                                \
    PLATFORM_CTCM0_START_ADDR, PLATFORM_CTCM1_START_ADDR, PLATFORM_STCM0_START_ADDR, PLATFORM_STCM1_START_ADDR, \
        PLATFORM_STCM2_START_ADDR, PLATFORM_STCM3_START_ADDR, 0xFFFFFFFFU, 0xFFFFFFFFU,                         \
        0xFFFFFFFFU, 0xFFFFFFFFU, PLATFORM_STCM8_START_ADDR

#define PLATFORM_BANK_END_ADDR                                                                          \
    PLATFORM_CTCM0_END_ADDR, PLATFORM_CTCM1_END_ADDR, PLATFORM_STCM0_END_ADDR, PLATFORM_STCM1_END_ADDR, \
        PLATFORM_STCM2_END_ADDR, PLATFORM_STCM3_END_ADDR, 0xFFFFFFFFU, 0xFFFFFFFFU,                     \
        0xFFFFFFFFU, 0xFFFFFFFFU, PLATFORM_STCM8_END_ADDR
#endif

#define PLATFORM_BANK_IS_ECC TRUE, TRUE, TRUE, TRUE, TRUE, FALSE, FALSE, FALSE, FALSE, FALSE, TRUE

#define PLATFORM_VBAT_LDORAM_IDX PLATFORM_STCM8_IDX

#elif defined(KW47B42Z83_cm33_core1_H_) || defined(KW47B42Z96_cm33_core1_H_) || defined(KW47B42Z97_cm33_core1_H_) || defined(KW47B42ZB2_cm33_core1_H_) || defined(KW47B42ZB3_cm33_core1_H_) || defined(KW47B42ZB6_cm33_core1_H_) || defined(KW47B42ZB7_cm33_core1_H_)
#define RADIO_IS_GEN_4P7 (1)
#define NXP_RADIO_GEN (470)
#define IS_APP_CORE (0)
#define IS_RADIO_CORE (1)
#ifndef KW47_core1_SERIES
#define KW47_core1_SERIES
#endif

/*! @brief define LTC0 from LTC. */
#define LTC0 LTC

#endif

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* KW47Z42082_COMMON_H_ */

